Tekla.Structures.DirectManipulation.Adapter.InteropExtensions
The Tekla.Structures.DirectManipulation.Adapter.InteropExtensions class is an extension class for general purpose interoperation conversion methods.

Tekla.Structures.DirectManipulation.Adapter.InteropExtensions.AsString(Tekla.Structures.Internal.dotPoint_t)
Returns a System.String that represents the Tekla.Structures.Internal.dotPoint_t.
point: The point to get a string representation for.
Returns: A System.String that represents the Tekla.Structures.Internal.dotPoint_t.

Tekla.Structures.DirectManipulation.Adapter.InteropExtensions.ToVector3(Tekla.Structures.Internal.dotPoint_t)
Converts a value of Tekla.Structures.Internal.dotPoint_t to a value of Tekla.Common.Geometry.Vector3.
point: The point to convert.
Returns: The converted vector.

Tekla.Structures.DirectManipulation.Adapter.InteropExtensions.ToVector3(System.Collections.Generic.IEnumerable{Tekla.Structures.Internal.dotPoint_t})
Converts a collection of Tekla.Structures.Internal.dotPoint_t values to a collection of Tekla.Common.Geometry.Vector3 values.
points: The points to convert.
Returns: The converted vectors.

Tekla.Structures.DirectManipulation.Adapter.InteropExtensions.ToUnitVector3(Tekla.Structures.Internal.dotPoint_t)
Converts an instance of Tekla.Structures.Internal.dotPoint_t to an instance of Tekla.Common.Geometry.UnitVector3.
point: The point to convert.
Returns: The converted vector.

Tekla.Structures.DirectManipulation.Adapter.InteropExtensions.TryToUnitVector3(Tekla.Structures.Internal.dotPoint_t,Tekla.Common.Geometry.UnitVector3@)
Tries to convert an instance of Tekla.Structures.Internal.dotPoint_t to an instance of Tekla.Common.Geometry.UnitVector3.
point: The point to convert.
vector: The converted unit vector.
Returns: True if point can be converted to a Tekla.Common.Geometry.UnitVector3 value; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.InteropExtensions.Convert(Tekla.Common.Geometry.Vector3)
Converts an instance of Tekla.Common.Geometry.Vector3 to an instance of Tekla.Structures.Internal.dotPoint_t.
vector: The vector to convert.
Returns: The converted point.

Tekla.Structures.DirectManipulation.Adapter.InteropExtensions.Convert(Tekla.Common.Geometry.UnitVector3)
Converts an instance of Tekla.Common.Geometry.UnitVector3 to an instance of Tekla.Structures.Internal.dotPoint_t.
vector: The vector to convert.
Returns: The converted point.

Tekla.Structures.DirectManipulation.Adapter.InteropExtensions.Select``2(System.Collections.Generic.IEnumerable{``0},System.Int32,System.Func{``0,``1})
Converts the given collection of  instances
to an array with the given arraySize containing the converted  instances.
The type of the elements of source.
The type of the value returned by selector.
source: A sequence of values to invoke a transform function on.
arraySize: The fixed size of the resulting array.
selector: A transform function to apply to each element from source.
Returns: An array of size arraySize containing the elements from source converted by the given selector.